<template>
  <div class="textCommonent">
    <div v-if="number == 1">
      <h3>协会简介</h3>
      <p>
        算法协会是一个以计算机软件算法为核心的组织，
        它力求以严格、规范、先进的模式，为广大学生提供一个学习、监督、交流的平台，
        为培养专业、全面、领先的计算机高技术型人才服务。
      </p>
    </div>
    <div v-else-if="number == 2">
      <h3>协会负责人</h3>
      <p>
        刘德，男，软工1804班，算法协会会长，入党积极分子。热爱运动，喜欢打羽毛球和乒乓球。为人比较活跃，喜欢参加各种活动，以此来充实自己的大学生活。希望在数计学院算法协会学习到更多专业技能，希望能为数计学院学风建设做出一点贡献。
      </p>
      <p>
        杨宇千，男，大类1901班，算法协会副会长。热爱编程，喜欢钻研各种问题，学习最前沿的技术。在GitHub上有着十几万的代码量，拥有一定的开发经验。曾参与过数计学院的网站建设。平时爱好是听音乐，看书。希望能够通过算法协会，为学院的学风和技术氛围的建设做出自己的贡献。
      </p>
      <p>
        周云，男，软工1801班，算法协会副会长，入党积极分子。兴趣爱好是跑步，打羽毛球，看动漫。专业基础知识掌握牢固，面对困难乐观积极进取，能主动探索自己的知识盲区，拓宽自己的眼界。希望在数计学院算法协会不仅能学习各种优化算法，提升自己的编程能力，更能在与协会成员磨合过程中，提升自己的团队协作能力。
      </p>
    </div>
    <div v-else-if="number == 3">
      <h3>协会机构</h3>
    </div>
    <div v-else-if="number == 4">
      <h3>协会章程</h3>
      <p>
        （1）每位成员对于平时的做题训练，题目讲解以及开会等活动，不得无故缺勤。若无故缺勤，事后需向管理组负责人阐明具体情况。
        （2）协会成员因紧急的事情而耽误协会工作时，需向相对应负责人请假，阐述具体原因，再由相关负责人向管理组报备，做好记载。
        （3）协会成员不得多次请假，滞后协会工作和日常学习进度，对于多次请假者，需向管理组相关负责人提交一份说明书，要阐明每次缺勤缘由并将耽误的工作弥补起来。
        （4）每位成员在加入协会之前应写一份保证书，表明自己加入协会的意愿并且将为协会的运营建设出力，不能中途退出，否则需向协会负责人分别提交一份退会申请书。
        （5）针对每位成员的平时表现，对于平时表现优异的同学给予适当的奖励（物质奖励和精神奖励）。
      </p>
    </div>
    <div v-else-if="number == 5">
      <h3>联系我们</h3>
    </div>
    <div v-else-if="number == 6">
      <h3>成员风采</h3>
    </div>
    <div v-else-if="number == 7">
      <h3>招新专区</h3>
    </div>
    <div v-else-if="number == 8">
      <h3>技术专栏</h3>
    </div>
    <div v-else>
      <h3>活动纪实</h3>
    </div>
  </div>
</template>
<script>
export default {
  name: "DetailComponent",
  props: {
    number: Intl
  }
};
</script>
<style>
h2 {
  text-align: left;
}
</style>
